package rf.aleksper;

import java.util.stream.IntStream;

/*
  1. Напишите программу, которая использует Stream API для обработки списка чисел.
     Программа должна вывести на экран среднее значение всех четных чисел в списке.
 */
public class App {
    public static void main(String[] args) {
        System.out.println("");
    }
}
